module.exports.config = {
 name: "goiadmin",
 version: "1.0.0",
 hasPermssion: 0,
 credits: "SHAHADAT SAHU ",
 description: "Bot will reply when someone tags any of the admins",
 commandCategory: "Other",
 usages: "@",
 cooldowns: 1
};

module.exports.handleEvent = function({ api, event }) {
 const adminIDs = ["61582708907708", "100001039692046", "61576394315037"].map(String);
 
 if (adminIDs.includes(String(event.senderID))) return;

 const mentionedIDs = event.mentions ? Object.keys(event.mentions).map(String) : [];
 const isMentioningBoss = adminIDs.some(adminID => mentionedIDs.includes(adminID));

 if (isMentioningBoss) {
 const replies = [
 "ডাকাডাকি করিস না রাহাদ বস ব্যস্ত আছে 😒",
 "@Rahat Islam বস এক আবাল তোমাকে মেনশন দিছে😁",
 "এমন ভাবে মেনশন দিতাছত মনে হয় তোর গার্লফ্রেন্ড টা রাহাদ বসকে দিয়া দিবি😒",
 "Rahat বস এক পাগল তোমাকে ডাকতেছে 🐸🫩🫵",
 "বস এক হালায় তোমার নাম ধরছে , তুমি শুধু একবার বলো, আজকে হালার নানিরে চমলক্ক করে দিমু 😑🥴",
 "মেনশন না দিয়া রাহাদ বসকে একটা girlfriend খুজে দে 😮💨",
 "মাইয়া হলে রাহাদ বসের ইনবক্স এ যাও😗😁",
 "Rahat boss নতুন কমান্ড বানাচ্ছে🥵 ডিস্টার্ব করিস না",
 "বস এখন আমার সাথে মিটিং এ আছে , মেনশন দিস না 🙂",
 "রাহাদ বস এখন আমার সাথে খেলছে🥵 ডিস্টার্ব করিস না",
 "মেনশন না দিয়া বস বল বস 🥵💋",
 "কিরে তোর এতো সাহস আমার বসের নাম ধরিস😾🫵",
 "এতো মেনশন না দিয়া তোর গার্লফ্রেন্ডটারে দিয়া দে😹🐸",
 "গুপে রাহাদ রাহাদ না করে সমস্যা থাকলে রাহাদ বসের ইনবক্সে যা😗",
 "বস তো এখন আমার দুধ খাচ্ছে, তুই ততক্ষণ মাথা ঠান্ডা রাখ 😌🍵",
 "তুই কি আমার বসের ফ্যান নাকি অ্যাটেনশন সিকার? 😹🎯",
 "বস তো এখন প্রেমের ক্লাসে বসা, পরে নক কর 😏📚",
 "বস এখন মোবাইল চার্জ দিতেছে, চার্জ শেষ হলে মাইরা দিবে তোকে 🔋🪫",
 "বস এখন আফসোস করতেছে কীসের জন্য যে তোরে গ্রুপে ঢুকাইছে 😑",
 ];
 return api.sendMessage(replies[Math.floor(Math.random() * replies.length)], event.threadID, event.messageID);
 }
};

module.exports.run = async function() {};
